Tekla Open API Reference for Tekla Structures 2025
DatabaseObject.Delete Method
 Deletes the instance from the database.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public abstract bool Delete()
Public MustOverride Function Delete As Boolean
Return Value
Type: Boolean
True on success.
See Also
Reference
DatabaseObject Class
Tekla.Structures.Drawing Namespace